{
    "title": "Arrow Twist",
    "icon": "Images/Projects/ArrowTwist/ProjectIcon.jpg",
    "description": "Arcade reflex game with rotating targets and precision shooting.",
    "shortDesc": "Shoot arrows into spinning logs without hitting obstacles. Time your shots, dodge spikes, slash apples, and face off against bosses every few levels. Unlock special bows and arrows while testing your reflexes in this high-speed tap game.",
    "playLink": "",
    "youtube": "https://www.youtube.com/embed/nqcuOXFJxGM",
    "screenshots": 
    [
        "Images/Projects/ArrowTwist/Screenshot_1.png",
        "Images/Projects/ArrowTwist/Screenshot_2.png",
        "Images/Projects/ArrowTwist/Screenshot_3.png", 
        "Images/Projects/ArrowTwist/Screenshot_4.png",
        "Images/Projects/ArrowTwist/Screenshot_5.png",
        "Images/Projects/ArrowTwist/Screenshot_6.png",
        "Images/Projects/ArrowTwist/Screenshot_7.png",
        "Images/Projects/ArrowTwist/Screenshot_8.png"
    ],
    "roles": [
        "Sole developer responsible for core gameplay, visuals, and level design.",
        "Implemented tap-to-shoot mechanics with rotating log target behavior.",
        "Designed dynamic rotation patterns, including direction shifts and speed ramps.",
        "Built a progression system with boss levels, unlockable bows, and apples as currency.",
        "Added UI/UX for level flow, arrow count, fail/retry, and unlock screens.",
        "Integrated rewarded ads, IAPs, and a cosmetic system for new arrow styles.",
        "Optimized for one-handed portrait play and lightweight mobile performance."
    ],
    "contributions": [
        {
            "name": "Gameplay & Shooting Mechanics",
            "image": "",
            "shortDesc": "Created reflex-based arcade shooting mechanics with strategic timing.",
            "details": [
                "Developed core tap-to-shoot input with collision checks for existing arrows and spikes.",
                "Implemented rotating wheel logic with random speed and direction patterns.",
                "Introduced apples as targets for bonus rewards and arrow skins.",
                "Balanced challenge through increasing arrow counts and smaller safe zones."
            ]
            },
        {
            "name": "Boss Levels & Progression",
            "image": "",
            "shortDesc": "Designed special levels and unlock systems tied to boss encounters.",
            "details": [
                "Created boss stages every 5 levels with unique behaviors and designs.",
                "Rewarded exclusive bows and arrows upon boss defeat.",
                "Tracked player progress and displayed level transitions with celebratory feedback.",
                "Stored progress and unlocks across sessions using persistent save systems."
            ]
        },
        {
            "name": "Visual FX & Sound Design",
            "image": "",
            "shortDesc": "Enhanced satisfaction through impactful audio-visual feedback.",
            "details": [
                "Added squash/stretch animations, glow effects, and arrow trails.",
                "Played hit, miss, and apple-slash sound cues synced with impact timing.",
                "Created a variety of backgrounds and wheel textures to avoid visual fatigue.",
                "Used punchy SFX and funky background music to keep energy high."
            ]
        },
        {
            "name": "Monetization & Customization",
            "image": "",
            "shortDesc": "Incentivized play and personalization through smart monetization.",
            "details": [
                "Integrated rewarded ads for continues, coins, and exclusive arrow skins.",
                "Added IAPs for coin packs and ad removal.",
                "Implemented a cosmetic system with arrows and bows unlocked via apples or progress.",
                "Balanced monetization to reward skill while keeping gameplay fair and fun."
            ]
        },
        {
            "name": "Optimization & Deployment",
            "image": "",
            "shortDesc": "Delivered high performance across devices and published to Google Play.",
            "details": [
                "Kept APK lightweight by compressing assets and using pooling systems.",
                "Ensured 60 FPS performance even on entry-level Android devices.",
                "Managed Play Store assets including listing descriptions, icons, and feature graphics.",
                "Handled app updates, bug fixes, and crash reports for a smooth player experience."
            ]
        }
    ]
}