{
    "title": "Nut Color Sort",
    "icon": "Images/Projects/NutColorSort/ProjectIcon.jpg",
    "description": "Satisfying puzzle game to sort nuts by color and type.",
    "shortDesc": "Relax and challenge your brain in this colorful sorting puzzle. Tap to move nuts across branches and organize them by type. Plan your moves carefully and unwind with smooth visuals and satisfying animations across hundreds of handcrafted levels.",
    "playLink": "https://play.google.com/store/apps/details?id=com.RunyGames.NutSort",
    "youtube": "https://www.youtube.com/embed/5ALWKA5Ul1s",
    "screenshots": 
    [
        "Images/Projects/NutColorSort/Screenshot_1.jpg",
        "Images/Projects/NutColorSort/Screenshot_2.jpg",
        "Images/Projects/NutColorSort/Screenshot_3.jpg", 
        "Images/Projects/NutColorSort/Screenshot_4.jpg",
        "Images/Projects/NutColorSort/Screenshot_5.jpg",
        "Images/Projects/NutColorSort/Screenshot_6.jpg"
    ],
    "roles": [
        "Designed and developed the game end-to-end including visuals, gameplay, and UX.",
        "Built core sorting mechanics with stack and color-match logic using Unity.",
        "Implemented level progression with increasing difficulty and strategic challenge.",
        "Added soft currency system, undo/move limit logic, and power-ups like hints and branch shuffles.",
        "Integrated rewarded ads for hints and retries, along with IAPs for coin packs.",
        "Optimized visuals and transitions to create a relaxing, polished experience."
    ],
    "contributions": [
        {
            "name": "Core Gameplay Logic",
            "image": "Images/Projects/NutSort/Logic.jpg",
            "shortDesc": "Designed addictive sorting mechanics with intuitive controls.",
            "details": [
                "Developed tap-and-transfer logic for sorting nuts across branches.",
                "Implemented rules for valid moves, color stacking, and win detection.",
                "Supported undo, retry, and level skip mechanics to enhance user experience.",
                "Created smooth animations with haptic feedback for satisfying interaction."
            ]
        },
        {
            "name": "Level System & Progression",
            "image": "Images/Projects/NutSort/Levels.jpg",
            "shortDesc": "Built a flexible level system with hundreds of handcrafted puzzles.",
            "details": [
                "Designed dynamic difficulty scaling with increasing branch and nut complexity.",
                "Used scriptable level data for modular editing and quick balancing.",
                "Enabled retry logic, move counters, and level completion scoring.",
                "Added daily challenge levels and randomized puzzle packs for replayability."
            ]
        },
        {
            "name": "Monetization & Retention",
            "image": "Images/Projects/NutSort/Monetization.jpg",
            "shortDesc": "Integrated monetization with minimal disruption to gameplay.",
            "details": [
                "Implemented rewarded ads for hints, undo, and continue after failure.",
                "Added in-app purchases for coin packs and ad-free upgrade.",
                "Designed fair progression pacing to avoid hard paywalls.",
                "Incorporated daily rewards and login streak bonuses to improve retention."
            ]
        },
        {
            "name": "Visual Polish & UX",
            "image": "Images/Projects/NutSort/UI.jpg",
            "shortDesc": "Delivered a smooth and relaxing puzzle experience with polished UI.",
            "details": [
                "Created a minimalist interface with clear branch visuals and color-coded nuts.",
                "Used animations and particle feedback for each action and completion.",
                "Designed intuitive navigation for levels, shop, and settings.",
                "Maintained responsive design for various aspect ratios and devices."
            ]
        },
        {
            "name": "Performance & Publishing",
            "image": "Images/Projects/NutSort/Performance.jpg",
            "shortDesc": "Optimized the game for smooth performance and store deployment.",
            "details": [
                "Minimized memory usage using pooling and batching techniques.",
                "Tested across devices to ensure consistent 60 FPS experience.",
                "Published on Google Play with optimized graphics, icons, and metadata.",
                "Maintained small APK size and ensured compatibility across Android versions."
            ]
        }
    ]
}