{
    "title": "World of Rabin",
    "icon": "Images/Projects/WorldOfRabin/ProjectIcon.jpg",
    "description": "A logical 2D platformer with minimalist puzzle design.",
    "shortDesc": "Navigate a mystical realm filled with logical platforming challenges. Help two friends escape from the depths of Rabin by solving increasingly complex puzzles across beautifully crafted stages.",
    "playLink": "",
    "youtube": "",
    "screenshots": 
    [
        "Images/Projects/WorldOfRabin/Screenshot_1.jpg",
        "Images/Projects/WorldOfRabin/Screenshot_2.jpg",
        "Images/Projects/WorldOfRabin/Screenshot_3.jpg", 
        "Images/Projects/WorldOfRabin/Screenshot_4.jpg",
        "Images/Projects/WorldOfRabin/Screenshot_5.jpg",
        "Images/Projects/WorldOfRabin/Screenshot_6.jpg"
    ],
    "roles": [
        "End-to-end solo development of the game using Unity 2D, including architecture, design, art, sound, and deployment.",
        "Designed core gameplay mechanics focused on platforming logic, jumping puzzles, and player progression.",
        "Created scalable and reusable level templates with configurable challenge parameters.",
        "Built a lightweight UI/UX system with minimal distraction and thematic clarity.",
        "Integrated all visual, audio, and animation assets to maintain an immersive and cohesive game experience.",
        "Managed build optimization, testing, bug fixing, and Play Store publishing pipeline."
    ],
    "contributions": [
        {
            "name": "Core Gameplay & Mechanics",
            "image": "",
            "shortDesc": "Built a platforming system that merges timing with logical puzzle-solving.",
            "details": [
                "Implemented smooth jump and step mechanics with tight input controls.",
                "Designed dynamic obstacles and interactive steps triggered by player actions.",
                "Gradually increased complexity per level to teach through gameplay.",
                "Maintained a learning curve that accommodates both casual and skilled players."
            ]
        },
        {
            "name": "Level Design & Progression",
            "image": "",
            "shortDesc": "Crafted modular levels that build logical intuition and storytelling without words.",
            "details": [
                "Developed chapter-based levels with unique platforming layouts and progression systems.",
                "Introduced new mechanics such as vanishing steps, delayed triggers, and pattern-based jumps.",
                "Balanced levels for retryability, checkpoint fairness, and consistent pacing.",
                "Used visual contrast and silhouette cues to guide player decisions."
            ]
        },
        {
            "name": "Narrative & Theme",
            "image": "",
            "shortDesc": "Developed a symbolic narrative of escape and companionship in a mysterious world.",
            "details": [
                "Built a story around two friends trapped in an endless pit called Rabin, inspired by mythological themes.",
                "Emphasized environmental storytelling over dialogue to evoke curiosity and emotion.",
                "Used visual metaphors like ascending light, shadow pits, and fog to represent progress and hope.",
                "Encouraged player interpretation through abstract world-building elements."
            ]
        },
        {
            "name": "UI/UX & Visual Direction",
            "image": "",
            "shortDesc": "Designed minimal and immersive interface to support a distraction-free experience.",
            "details": [
                "Created clean, HUD-light interfaces with contextual cues.",
                "Maintained a cohesive visual theme using muted colors, shadowed platforms, and ambient lighting.",
                "Integrated feedback animations and transitions to enhance user experience without clutter.",
                "Ensured consistency across different screen sizes and aspect ratios."
            ]
        },
        {
            "name": "Optimization & Publishing",
            "image": "",
            "shortDesc": "Optimized the game for Android devices and managed the Google Play deployment.",
            "details": [
                "Compressed assets and minimized draw calls to support smooth performance on low-end devices.",
                "Handled input scaling for different resolutions and frame rates.",
                "Set up Play Store metadata, feature graphics, store listing assets, and privacy policy.",
                "Tested and deployed multiple builds ensuring compatibility and responsiveness."
            ]
        }
    ]
}